In [155]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
from sklearn.preprocessing import OneHotEncoder
%matplotlib inline

In [2]:
dataset = pd.read_csv(r"C:\Users\ugo\Desktop\survivor_prediction.csv")
dataset.head()

  pclass   sex   age survived
0  first  male  30.0       No
1  first  male  39.0       No
2  first  male  71.0       No
3  first  male  45.0       No
4  first  male  42.0       No

In [18]:
dataset_categorical = dataset[['pclass','sex']]
dataset_categorical.columns

Index(['pclass', 'sex'], dtype='object')

In [19]:
dataset.count()

pclass      529
sex         529
age         529
survived    529
dtype: int64

In [28]:
encoder = OneHotEncoder(handle_unknown='ignore',sparse=False)
new_dataframe = pd.DataFrame(encoder.fit_transform(dataset_categorical))

In [30]:
new_dataframe.columns = encoder.get_feature_names_out(['pclass','sex'])

In [31]:
new_dataframe

     pclass_business  pclass_economy  pclass_first  sex_female  sex_male
0                0.0             0.0           1.0         0.0       1.0
1                0.0             0.0           1.0         0.0       1.0
2                0.0             0.0           1.0         0.0       1.0
3                0.0             0.0           1.0         0.0       1.0
4                0.0             0.0           1.0         0.0       1.0
..               ...             ...           ...         ...       ...
524              0.0             1.0           0.0         1.0       0.0
525              0.0             1.0           0.0         1.0       0.0
526              0.0             1.0           0.0         1.0       0.0
527              0.0             1.0           0.0         1.0       0.0
528              0.0             1.0           0.0         1.0       0.0

[529 rows x 5 columns]

In [40]:
dataset_numerical = dataset.drop(['pclass','sex','survived'],axis=1)
dataset_numerical

      age
0    30.0
1    39.0
2    71.0
3    45.0
4    42.0
..    ...
524  29.0
525  18.0
526  63.0
527  47.0
528  15.0

[529 rows x 1 columns]

In [41]:
target_variable = dataset['survived']
target_variable

0       No
1       No
2       No
3       No
4       No
      ...
524    Yes
525    Yes
526    Yes
527    Yes
528    Yes
Name: survived, Length: 529, dtype: object

In [66]:
final_df = pd.concat([new_dataframe,dataset_numerical],axis=1)
final_df

     pclass_business  pclass_economy  pclass_first  sex_female  sex_male   age
0                0.0             0.0           1.0         0.0       1.0  30.0
1                0.0             0.0           1.0         0.0       1.0  39.0
2                0.0             0.0           1.0         0.0       1.0  71.0
3                0.0             0.0           1.0         0.0       1.0  45.0
4                0.0             0.0           1.0         0.0       1.0  42.0
..               ...             ...           ...         ...       ...   ...
524              0.0             1.0           0.0         1.0       0.0  29.0
525              0.0             1.0           0.0         1.0       0.0  18.0
526              0.0             1.0           0.0         1.0       0.0  63.0
527              0.0             1.0           0.0         1.0       0.0  47.0
528              0.0             1.0           0.0         1.0       0.0  15.0

[529 rows x 6 columns]

In [67]:
final_df.dtypes

pclass_business    float64
pclass_economy     float64
pclass_first       float64
sex_female         float64
sex_male           float64
age                float64
dtype: object

In [121]:
final_df.columns

Index(['pclass_business', 'pclass_economy', 'pclass_first', 'sex_female',
       'sex_male', 'age'],
      dtype='object')

In [68]:
from sklearn.model_selection import train_test_split

In [69]:
X_train,X_test,y_train,y_test = train_test_split(final_df,target_variable,test_size=0.2)

In [109]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegressionCV

In [110]:
log = LogisticRegressionCV()

In [111]:
log.fit(X_train,y_train)

LogisticRegressionCV()

In [112]:
y_pred = log.predict(X_test)

In [113]:
y_test.shape

(106,)

In [114]:
from sklearn.metrics import accuracy_score,f1_score,confusion_matrix

In [115]:
print(accuracy_score(y_test,y_pred))
print(confusion_matrix(y_test,y_pred))

0.8301886792452831
[[54  7]
 [11 34]]

In [116]:
import joblib

In [119]:
logreg = open("log_reg","wb")
joblib.dump(log,logreg)
logreg.close()